I am facing the same issue on repeated applys with `terraform v1.5.5`. In my case, this didn't start popping up until I used the `http` data resource to dynamically set the controller's ip.

My temporary fix was to expand each rule to only define 1 cidrblock per rule. This allows terraform to succeed but now plan returns 2 different plans:
- Shows that at-least 1 rule is created and none are destroyed, but I can see that the old rule is overwritten. Note how it is re-creating `0.0.0.0/0`, which is hardcoded, instead of the dynamic ip.
```
# module.security_us_west_2.aws_security_group_rule.rule["tcp_22_null_ingress_0.0.0.0/0"] will be created
  + resource "aws_security_group_rule" "rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-05ed6e13e4337d822"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }
...
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
- Shows that no changes are needed
```
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

This is also 2 steps back, 1 forward, since I first remove duplicate cidrblocks and now need to expand it back out per cidrblock. This also slowed down terraform a bit and clutters the plan.

---

I see that there are 2 new resources listed as a note for the `aws_security_group_rule` resource. The only issue is that I see that there is a duplicate issue for it as well, though OP noted that it might be due to the create before destroy lifecycle: https://github.com/terraform-aws-modules/terraform-aws-security-group/issues/225 .
```
... Both of these resource were added before AWS assigned a [security group rule unique ID](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/security-group-rules.html), and they do not work well in all scenarios using thedescription and tags attributes, which rely on the unique ID. The [aws_vpc_security_group_egress_rule](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/vpc_security_group_egress_rule) and [aws_vpc_security_group_ingress_rule](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/vpc_security_group_ingress_rule) resources have been added to address these limitations and should be used for all new security group rules...
```